tests/sod_2f_hllc_vanleer/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoPimpleFoam;

Tmax -0.003483;

fluxScheme 1;

energyGroups    1;

externalCycles  1;

eulRel  1;

materials  2;

quasi_single false;

criticalityCalculation 0;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         1;

deltaT          0.5e-4; //0.1

writeControl    runTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  15;

nominalPower 100;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           0.5;

KeffControl     0.97063;



// ************************************************************************* //
