tests/sod_2f_hllc_vanleer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.0 -0.1 -0.1)
    (1.0 -0.1 -0.1)
    (1.0  0.1 -0.1)
    (0.0  0.1 -0.1)
    (0.0 -0.1  0.1)
    (1.0 -0.1  0.1)
    (1.0  0.1  0.1)
    (0.0  0.1  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1100 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }
    rightWall
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    freeWall
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (2 3 7 6)
            (4 5 6 7)
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
