tests/sod_2f_hllc_vanleer/constant/delayedNeutronConstants
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      delayedNeutronConstants;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

lam1            lam1 [0 0 -1 0 0 0 0] 1.24667E-02;
lam2            lam2 [0 0 -1 0 0 0 0] 2.82917E-02;
lam3            lam3 [0 0 -1 0 0 0 0] 4.25244E-02;
lam4            lam4 [0 0 -1 0 0 0 0] 1.33042E-01;
lam5            lam5 [0 0 -1 0 0 0 0] 2.92467E-01;
lam6            lam6 [0 0 -1 0 0 0 0] 6.66488E-01;
lam7            lam7 [0 0 -1 0 0 0 0] 1.63478E+00;
lam8            lam8 [0 0 -1 0 0 0 0] 3.55460E+00;



beta1            beta1 [0 0 0 0 0 0 0] 2.18743E-04;
beta2            beta2 [0 0 0 0 0 0 0] 8.65027E-04;
beta3            beta3 [0 0 0 0 0 0 0] 6.30422E-04;
beta4            beta4 [0 0 0 0 0 0 0] 1.21169E-03;
beta5            beta5 [0 0 0 0 0 0 0] 1.93463E-03;
beta6            beta6 [0 0 0 0 0 0 0] 5.95476E-04;
beta7            beta7 [0 0 0 0 0 0 0] 5.67625E-04;
beta8            beta8 [0 0 0 0 0 0 0] 1.51076E-04;

// ************************************************************************* //
