tests/sod_2f_hllc_vanleer/constant/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialConstants;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

p0              p0 [1 -1 -2 0 0 0 0] 0.0;
T0              T0 [0 0 0 1 0 0 0] 0.002787;

EOS_m0          0;
R_m0            R_m0 [0 2 -2 -1 0 0 0] 287.0856;

EOS_m1          1;
psi_m1          psi_m1 [0 -2 2 0 0 0 0] 3.0;
beta_m1         beta_m1 [1 -3 0 -1 0 0 0] 100;
rho0_m1         rho0_m1 [1 -3 0 0 0 0 0] 0.1;

Cv_m0           Cv_m0 [0 2 -2 -1 0 0 0] 717.857;
Cv_m1           Cv_m1 [0 2 -2 -1 0 0 0] 717.857;

Cp_m0           Cp_m0 [0 2 -2 -1 0 0 0] 1005;
Cp_m1           Cp_m1 [0 2 -2 -1 0 0 0] 1005; //717.857;





// ************************************************************************* //
