tests/sod_2f_hllc_vanleer/constant/nuclearProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      nuclearProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

TrefXS          TrefXS [0 0 0 1 0 0 0] 300;
rhoReference    rhoReference [1 -3 0 0 0 0 0] 18950;

energyGroups    energyGroups 1;

// ************************************************************************* //
