tests/sod_2f_hllc_vanleer/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p               1
    volScalarFieldValue rho             1
    volScalarFieldValue rho_m0          1
    volScalarFieldValue rho_m1          1
    volScalarFieldValue alpha_m0        1
    volScalarFieldValue alpha_m1        1e-6
    volScalarFieldValue T               0.003483
    volScalarFieldValue R_m0            287.0856
    volScalarFieldValue R_m1            287.0856
    volScalarFieldValue rho0            0.0
    volScalarFieldValue p0              0.0
);

regions
(
    boxToCell
    {
        box (0.5  -1 -1) (10  1 1);
        fieldValues
        (
            volScalarFieldValue p               0.1
            volScalarFieldValue rho             0.125
            volScalarFieldValue rho_m0          0.125
            volScalarFieldValue rho_m1          0.125
            volScalarFieldValue T               0.002787
        );
    }
    
    boxToCell
    {
        box (0.7  -1 -1) (10  1 1);
        fieldValues
        (
            volScalarFieldValue alpha_m0        1e-6
            volScalarFieldValue alpha_m1        1
            volScalarFieldValue rho_m0          0.4
            volScalarFieldValue rho_m1          0.4
            volScalarFieldValue rho0            0.1
            volScalarFieldValue p0              0.0
            volScalarFieldValue T               0.002787
        );
    }
);


// ************************************************************************* //   
