tests/sod_2f_hllc_vanleer/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    {
        name    leftFace;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
		name   leftWall;
        }

    }

    {
        name    leftCell;
        type    cellSet;
        action  new;
        source  faceToCell;
        sourceInfo
        {
            set leftFace;
            option all;
        }
    }

);

// ************************************************************************* //
